In [48]:
import pandas as pd

In [49]:
carstocks=pd.read_csv("data/car_stocks.csv")

In [50]:
carstocks.head()

,Symbol,Date,Open,High,Low,Close,Adj Close,Volume
0,RIVN,2021-11-10,106.750000,119.459999,95.199997,100.730003,100.730003,103679500
1,RIVN,2021-11-11,114.625000,125.000000,108.010002,122.989998,122.989998,83668200
2,RIVN,2021-11-12,128.645004,135.199997,125.250000,129.949997,129.949997,50437500
3,RIVN,2021-11-15,130.800003,152.529999,127.510002,149.360001,149.360001,64982300
4,RIVN,2021-11-16,163.800003,179.470001,153.779999,172.009995,172.009995,94036600

In [51]:
carstocks[carstocks["Symbol"]=="LCID"]["Close"].mean()

49.82923061538462

In [52]:
carstocks.groupby("Symbol")["Close"].mean()

Symbol
GM       62.164615
LCID     49.829231
RIVN    127.523077
Name: Close, dtype: float64

In [53]:
titanic=pd.read_csv("data/titanic.csv")

In [54]:
titanic.head(1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"

In [55]:
df=Titanic[["pclass","survived","sex","age"]]
df.head()

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167
2       1         0  female   2.0000
3       1         0    male  30.0000
4       1         0  female  25.0000

In [56]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.727468
male      0.190985
Name: survived, dtype: float64

In [57]:
titanic["age"]=titanic["age"].replace(["?"],[None]).astype("float")

In [58]:
titanic.groupby(["sex","pclass","survived"])["age"].mean()

sex     pclass  survived
female  1       0           35.200000
                1           37.109375
        2       0           34.090909
                1           26.711051
        3       0           23.418750
                1           20.814815
male    1       0           43.658163
                1           36.168240
        2       0           33.092593
                1           17.449274
        3       0           26.679598
                1           22.436441
Name: age, dtype: float64

In [59]:
titanic.groupby('pclass')['age'].size()-titanic.groupby('pclass')['age'].count()

pclass
1     39
2     16
3    208
Name: age, dtype: int64

In [66]:
def fff(j):
    return j.size-j.count()
titanic.groupby('pclass')['age'].agg(fff)

pclass
1     39
2     16
3    208
Name: age, dtype: int64